Revit 2027 API
TemporaryViewModes.CustomColor Property
 Custom color for the TemporaryViewProperties mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color CustomColor { get; set; }
Public Property CustomColor As Color
	Get
	Set
public:
property Color^ CustomColor {
	Color^ get ();
	void set (Color^ value);
}
member CustomColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 If custom title is not empty, Temporary View Properties mode displays the colored view frame in custom color.
See Also
Reference
TemporaryViewModes Class
Autodesk.Revit.DB Namespace